Taurus.yml
// example

---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple
  
scenarios:
  simple:
    think-time: 0.75
    requests:
    # Search all publication in display now.
    - url: http://10.133.80.251:8080/api/admin/v3/TW//category/layout/list?categoryId=&type=10000&status=2&offset=0&limit=20
      method: GET
      headers:
        Content-Type: application/json
    # Search publication by ‘Digest’ type in display now.
    - url: http://10.133.80.251:8080/api/admin/v3/TW//category/layout/list?categoryId=&type=20002&status=2&offset=0&limit=20
      method: GET
      headers:
        Content-Type: application/json
    # Search publication by ‘Top’ category in display now.
    - url: http://10.133.80.251:8080/api/admin/v3/TW//category/layout/list?categoryId=100000&type=20002&status=2&offset=0&limit=20
      method: GET
      headers:
        Content-Type: application/json
    # Search all article list in Display Now.
    - url: http://10.133.80.251:8080/api/admin/v3/TW/article/search
      method: POST
      body-file: 
            {
              "articleId": "",
              "title": "",
              "category": null,
              "subCategory": null,
              "media": "-1",
              "articleType": "DISPLAY_NOW",
              "pagination": {
                "page": 1
              },
              "startDate": "1514476800000"
            }
      headers:
        Content-Type: application/json
    # Search article by title in Display Now.
    - url: http://10.133.80.251:8080/api/admin/v3/TW/article/search
      method: POST
      body-file: 
            {
              "articleId": "",
              "title": "api",
              "category": null,
              "subCategory": null,
              "media": "-1",
              "articleType": "DISPLAY_NOW",
              "pagination": {
                "page": 1
              },
              "startDate": "1514476800000"
            }
      headers:
        Content-Type: application/json
    # Search all article list in available.
    - url: http://10.133.80.251:8080/api/admin/v3/TW/article/search
      method: POST
      body-file: 
            {
              "articleId": "",
              "title": "",
              "category": null,
              "subCategory": null,
              "media": "-1",
              "articleType": "AVAILABLE",
              "pagination": {
                "page": 1
              },
              "startDate": "1515513600000",
              "endDate": "1515859200000"
            }
      headers:
        Content-Type: application/json
    # Search article by category in available.
    - url: http://10.133.80.251:8080/api/admin/v3/TW/article/search
      method: POST
      body-file: 
            {
              "articleId": "",
              "title": "",
              "category": "100002",
              "subCategory": null,
              "media": "-1",
              "articleType": "AVAILABLE",
              "pagination": {
                "page": 1
              },
              "startDate": "1515513600000",
              "endDate": "1515859200000"
            }
      headers:
        Content-Type: application/json
    # Search article by title in available.
    - url: http://10.133.80.251:8080/api/admin/v3/TW/article/search
      method: POST
      body-file: 
            {
              "articleId": "",
              "title": "api",
              "category": null,
              "subCategory": null,
              "media": "-1",
              "articleType": "AVAILABLE",
              "pagination": {
                "page": 1
              },
              "startDate": "1515513600000",
              "endDate": "1515859200000"
            }
      headers:
        Content-Type: application/json
    # Portaljson
    - url: http://10.133.80.251:8080/api/TW/portaljson
      method: GET
      headers:
        Content-Type: application/json






// exmpale 2


---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple
  
scenarios:
  simple:
    think-time: 0.75
    requests:
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-1.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-2.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-3.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-4.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-5.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-6.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-7.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-8.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-9.json
      headers:
        Content-Type: application/json
    - url: https://api.today.line-beta.me/webapi/track/video/play
      method: POST
      body-file: body-file-10.json
      headers:
        Content-Type: application/json